---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCExtrusionBasis
source: html/19e272ae-693c-a2aa-31f1-0c5e442b8ba0.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionBasis

This enumerated type represents the possible bases for derivation of extrusion geometry.

## Syntax (C#)
```csharp
public enum IFCExtrusionBasis
```